/*5、有N个候选人，每个选民只能投一票，要求编写一个模拟10个选民进行投票的程
序，先后输入被选人的名字，最后按照选票由高到低输出投票结果。
*/
#include<stdio.h>
struct Donate
{
	char name[20];
	int n;
	Donate *next;
};
int main()
{
	Donate n[10]={{"一",0},{"二",0},{"三",0},{"四",0},{"五",0},{"六",0},{"七",0},{"八",0},{"九",0},{"十",0}};
	int i;
	char *m[10]={"一","二","三","四","五","六","七","八","九","十"};
	printf("请为以下候选人投票：\n");
	printf("%s\t%s\t%s\t%s\t%s\t%s\t%s\t%s\t%s\t%s\t\n","一","二","三","四","五","六","七","八","九","十");
	for(i=0;i<10;i++)
	{
		printf("请第%d个选民输入被选人名字：",i+1);
		gets(n[i].name);
		if(n[i].name==*m[i]) (n[i].n)++;
		else printf("输入错误，请重试");
		i-=1;
	}	
return 0;	
}
